Dewanshu-API-Assignment3/app/controllers/api/v1/articles_controller.rb

SELECT "articles".* FROM "articles"   ORDER BY created_at DESC
---
            def index
                articles = Article.order('created_at DESC');

SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = $1 LIMIT 1  [["id", 1]]
---
            def show
                article = Article.find(params[:id])

INSERT INTO "articles" ("body", "created_at", "title", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["body", "Crime"], ["created_at", "2019-10-16 12:40:36.947128"], ["title", "Sherlock"], ["updated_at", "2019-10-16 12:40:36.947128"]]
---
            def create
                article = Article.new(article_params)

                if article.save

SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = $1 LIMIT 1  [["id", 6]]
DELETE FROM "articles" WHERE "articles"."id" = $1  [["id", 6]]
---
            def destroy
                article = Article.find(params[:id])
                article.destroy

SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = $1 LIMIT 1  [["id", 5]]
UPDATE "articles" SET "body" = $1, "title" = $2, "updated_at" = $3 WHERE "articles"."id" = 5  [["body", "By Agatha Cistie"], ["title", "Updated Title is And then there were none"], ["updated_at", "2019-10-16 13:23:54.110804"]]
---
            def update
                article = Article.find(params[:id])
                if article.update_attributes(article_params)