DewanshuAssignment4-Blog-Rails4.1/app/controllers/articles_controller.rb

INSERT INTO "articles" ("created_at", "text", "title", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2019-10-18 09:45:09.566637"], ["text", "ef"], ["title", "grdg"], ["updated_at", "2019-10-18 09:45:09.566637"]]
---
    def create
        @article = Article.new(article_params)

        if @article.save