DewanshuAssignment4-Blog-Rails4.1/app/controllers/comments_controller.rb

    def create
      @article = Article.find(params[:article_id])
      @comment = @article.comments.create(comment_params)
---
SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = $1 LIMIT 1  [["id", 2]]
INSERT INTO "comments" ("article_id", "body", "commenter", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["article_id", 2], ["body", "wefewf"], ["commenter", "Aditi's Birthday was on October 16"], ["created_at", "2019-10-18 10:22:53.432501"], ["updated_at", "2019-10-18 10:22:53.432501"]]